IDEA Open Model
BeamDataEc2 Properties
Compatible with IDEA StatiCa 20.1
The BeamDataEc2 type exposes the following members.
Properties
Name | Description
BeamSpanLength
 beam span lengrh - theoretical support distance
DeflectionSheme
 type of span loads
CheckLimitDeflection
 indicator for check of limit deflection for beam span
CheckLimitDeflRheoEffects
 true for check of limit deflection for beam span from rheological effects of variable loads
IsAbsValueLimitDeflection
 true for absolute user value of limit deflection (both - total + rheological)
IsUserLimitDeflection
 true for user value of limit deflection (both - total + rheological)
IsYDirectionData
 true for deflection data in Y direction
Ln
 Length of beam
RequiredCamber
 required camber
TypeOfCalculation
 there are several types of calculation
TypeOfSupportLeft
 Type of support on the left side
TypeOfSupportRight
 Type of support on the right side
UserLimitDeflection
 user value of limit deflection - denominator - 1 / value
UserLimitDeflRheoEffects
 user value of limit deflection from rheological effects of variable loads - denominator - 1 / value
WidthOfSupportLeft
 Width of support on the left side
WidthOfSupportRight
 Width of support on the right side
Top
See Also
Reference
BeamDataEc2 Class
IdeaRS.OpenModel.Concrete Namespace